{
  "basics": {
    "name": "Kengo TODA",
    "label": "Tech & Team Lead",
    "email": "skypencil@gmail.com",
    "phone": "+86 131-2241-7703",
    "website": "https://kengotoda.github.io/",
    "summary": "Experienced to develop products with large scale dev team with high productivity and quality. Trusted as tech leader and reviewer, who can advice for architecture, testability and maintainability improvement. Experienced with web page performance improvement, static code analysis and OSS development.",
    "location": {
      "city": "Putuo",
      "countryCode": "China",
      "region": "Shanghai"
    },
    "profiles": [
      {
        "network": "Twitter",
        "username": "Kengo_TODA",
        "url": "https://twitter.com/Kengo_TODA"
      },
      {
        "network": "Facebook",
        "username": "Kengo TODA",
        "url": "facebook.com/kengo.toda"
      },
      {
        "network": "Slideshare",
        "username": "Kengo TODA",
        "url": "http://www.slideshare.net/kengotoda"
      },
      {
        "network": "Wechat",
        "username": "toda_k",
        "url": "http://www.wechat.com/en/"
      },
      {
        "network": "Speakerdeck",
        "username": "Kengo TODA",
        "url": "https://speakerdeck.com/eller86"
      }
    ]
  },
  "work": [
    {
      "company": "Works Applications co.,ltd.",
      "position": "R&D Engineer",
      "website": "http://worksap.com/",
      "startDate": "2008-04-01",
      "endDate": "2011-08-31",
      "summary": "Made customer's business efficient by solving performance bottlenecks in legacy Enterprise ERP systems. Responsible to reproduce existing bottlenecks in product locally, analyse it to identify root of problem, and solve it by changing implementation or optimize middleware configuration. Expected to understand a lot of technical knowledge and have deep and wide experiences, to support product development division as technical expert.",
      "highlights": [
        "Solves storage I/O storm problem in Oracle Database for COBOL/Java batches, without any additional hardware.",
        "Support product development division to upgrade JDK, to start managing log, and to introduce unit testing.",
        "Researched and evaluated how/why appliance from middleware vendor can improve performance of our product."
      ]
    },
    {
      "company": "Works Applications CHINA co.,ltd.",
      "position": "R&D Team Lead",
      "website": "http://worksap.com/",
      "startDate": "2011-09-01",
      "endDate": "2013-07-31",
      "summary": "Led developers at new abroad branch in Shanghai, to make it the most challenging development office. I was expected to tell corporate culture and the stance to solve problems, so I started from one-on-one and making official English document for training. My documentation started from a Wiki page, and now it is widely spreaded onto groupware and video based e-learning system by effort from many contributors. Of course I also challenged to be technical expert: maintained Cassandra cluster to host 24/7 web-mail system without RDBMS, deployed monitoring system onto Google App Engline, and made the first product on Java EE JAX-RS.",
      "highlights": [
        "Solved information gap and mismatch between headquoter in Japan and branch in abroad, by making English document actively and pushing team in Japan.",
        "Provided a web-mail system for 2,000+ employees in Japan and China. It is working 24/7 so I developed a monitoring system on Google App Engine to automate trouble shooting.",
        "Led and trained 8 developers to guide them to be technologist and to solve problem. They are now trusted as the most technical and challenging experts.",
        "Made official corporate GitHub account, and published several OSS. https://github.com/WorksApplications"
      ]
    },
    {
      "company": "Works Applications Singapore PTE LTD",
      "position": "Product Development Team Lead",
      "website": "http://worksap.com/",
      "startDate": "2013-08-01",
      "endDate": "2014-06-30",
      "summary": "Worked at the second abroad branch which is newly launched in Singapore. I was expected to reproduce previous work in Shanghai, and trained development team to implement high quality and secure product. For quality, my team successfully introduced JUnit tests for payment system in EC site, by my explanation about how to introduce CI and unit tests to legacy project. I also helped developers to unify logging rule, coding rule, version management system and how-to make development environment on developer's PC, to improve quality and productivity.",
      "highlights": [
        "Improved productivity by introducing Git: now developers in abroad office do not need to wait for uploading their achievement to VCS server in Japan.",
        "Worked with developers from many other regions and countries.",
        "Reduced 90% of log, by making rule for log level and logger setting."
      ]
    },
    {
      "company": "Works Applications CHINA co.,ltd.",
      "position": "R&D Manager",
      "website": "http://worksap.com/",
      "startDate": "2014-07-01",
      "summary": "Improved page rendering speed of new ERP product (AI Works http://www.worksap.com/products-solutions/about-our-product/) distributed on cloud. To stop redraw and reflow, I worked with a large team (20+ developers) to eliminated DOM manipulation by JS in page initialization phase by building UI component framework based on Google Closure Library. I also managed a team to develop another server side framework (Forneus: http://research.worksap.com/research/forneus/) to construct all necessary HTML in server side. By these two frameworks, our ERP product achieved 100ms rendering, so end users can enjoy quick response like consumer applications. I played role as developer, scrum master, product owner and code reviewer to help my teams' challenges to make product high-speed and available including: Google Closure Compiler, Google Closure Stylesheet, SPDY, HTTP/2, Server-Sent Events, WebSocket, Redis, Kafka and Kryo.",
      "highlights": [
        "Managed teams to develop client side & server side framework, and realised quick response within 100ms.",
        "Taught how to use JSDoc, Google Closure Library and Google Closure Compiler to developers familier with jQuery.",
        "Held technical session each month, to change atmosphere and enhance communication among developers.",
        "Reduced overworking time from 30% to 0% by mesuring spent time for each tasks by Redmine to understand fact to improve estimation and productivity.",
        "The most committed developer of 300+ in 3 countries.",
        "The most answered developer at QA site in intranet."
      ]
    }
  ],
  "education": [
    {
      "institution": "Tokyo University of Science",
      "area": "Physics",
      "studyType": "Bachelor",
      "startDate": "2004-04-01",
      "endDate": "2008-03-31",
      "courses": [
        "e-learning content http://www.rs.kagu.tus.ac.jp/yamalab/2007/toda/"
      ]
    }
  ],
  "skills": [
    {
      "name": "Java Development",
      "level": "Master",
      "keywords": [
        "Java8",
        "Maven Plugin",
        "Jenkins Plugin",
        "SLF4J",
        "Google Guava",
        "Google Truth",
        "Spring Framework",
        "Apache Commons",
        "JUnit4",
        "Logback",
        "ObjectWeb ASM",
        "Findbugs",
        "PMD",
        "JSR305",
        "PICT"
      ]
    },
    {
      "name": "System Performance Enhancer",
      "level": "Master",
      "keywords": [
        "JMX",
        "Oracle Java Mission Control (jmc)",
        "Statspack",
        "jcmd",
        "JMH",
        "IBM HeapAnalyzer",
        "IBM Thread and Monitor Dump Analyze for Java",
        "Unix commands",
        "AWS CloudWatch"
      ]
    },
    {
      "name": "Web Development",
      "level": "Advanced",
      "keywords": [
        "HTML",
        "CSS",
        "RequireJS",
        "JavaScript",
        "jQuery",
        "Google Closure Library",
        "QUnit",
        "Jasmine",
        "ESLint",
        "Bootstrap"
      ]
    },
    {
      "name": "Middleware (Architect, Developer and DBA)",
      "level": "Advanced",
      "keywords": [
        "Oracle Database",
        "IBM DB2",
        "SQLite",
        "Redis",
        "Apache Cassandra",
        "Hashicorp Consul",
        "Fluentd"
      ]
    },
    {
      "name": "Build System (Admin for OSS and large scale development (100~ developers))",
      "level": "Advanced",
      "keywords": [
        "Maven3",
        "Grunt",
        "npm",
        "karma",
        "WebPack",
        "Docker",
        "docker-compose",
        "Registrator",
        "Jenkins",
        "Slack",
        "Redmine",
        "Travis CI",
        "Google Closure Compiler",
        "Vagrant",
        "AWS"
      ]
    },
    {
      "name": "Team Building",
      "level": "Advanced",
      "keywords": [
        "Scrum Master",
        "Product Owner (Scrum)",
        "Problem Solving",
        "One on one"
      ]
    },
    {
      "name": "Interests",
      "level": "beginner",
      "keywords": [
        "rust (to make high performance app without null and multi thread problem)",
        "Vert.x (to make distributable system with back pressure consideration)",
        "Soot (to make high performance and extensible bytecode analysis framework)",
        "LLVM (to implement DSL for daily operation)",
        "WebAssembly (to make more faster web application, with support from static AST analysis)",
        "Electron (to make multi platform GUI application)"
      ]
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Professional working proficiency (4+ years)"
    },
    {
      "language": "Japanese",
      "fluency": "Native"
    },
    {
      "language": "Mandarine",
      "fluency": "Daily life (HSK 4th grade)"
    }
  ],
  "interests": [
    {
      "name": "Cooking",
      "keywords": [
        "Chinese dishes",
        "Japanese dishes"
      ]
    },
    {
      "name": "Reading",
      "keywords": [
        "Comic",
        "Food",
        "History",
        "Novel"
      ]
    }
  ],
  "publications": [
    {
      "name": "twistoire",
      "releaseDate": "2010-05-05",
      "website": "https://twitter.com/twistoire",
      "summary": "A web service to notice you when followers remove/block your twitter account. It works on Google App Engine (Java) and appengine-mapreduce. Analysis part is kicked by cron via TaskQueue, and runs on Backends. It uses Twitter4J to check diff of followers, and send direct message to users."
    },
    {
      "name": "Jenkins regression report plugin",
      "releaseDate": "2012-06-02",
      "website": "https://wiki.jenkins-ci.org/display/JENKINS/Regression+Report+Plugin",
      "summary": "A Jenkins plugin to send email if your test cases find regression. It helps legacy product to introduce CI step-by-step, even though it has failing test cases. This plugin fits requirement from many team and installed about 400 Jenkins servers in the world (the 515th popular plugin of the 1,073 at 2016/Mar)."
    },
    {
      "name": "FindBugs plugin for SLF4J",
      "releaseDate": "2012-08-26",
      "website": "https://github.com/KengoTODA/findbugs-slf4j",
      "summary": "SLF4J is really great library to handle logging, it helps us to realise both of detailed logs and high performance. But it is easy to misuse (e.g. e.getMessage() in log parameter, mismatch between numbers of {} and parameter), so your team need help from experienced developers to get review. This FindBugs plugin helps you to keep quality of your code, and scalability of development. It validates your code, and reports bugs and potential problems automatically. It also supports Java8 and latest FindBugs, so you can use it in production development."
    },
    {
      "name": "Guava helper for Java 8",
      "releaseDate": "2015-07-14",
      "website": "https://github.com/KengoTODA/guava-helper-for-java-8",
      "summary": "Collectors for Guava collections, and FindBugs plugin to detect usage of deprecated API. It helps Java developers to use only good parts in Guava, even though it has old parts replaced with Java8 new API."
    }
  ],
  "references": [
    {
      "name": "Anonymous",
      "reference": "One of the most knowledgeable and enthusiastic person in technical field. Gives huge support for the entire department."
    },
    {
      "name": "Anonymous",
      "reference": "Have great knowledge in technology, and thinks the whole project and Shanghai Office as his responsibility."
    }
  ]
}
